import numpy as np

x1 = np.array([1,2,3])  # (3,) - 벡터. 1차원
print("x1 = ", x1.shape)    # x1 =  (3,)

x2 = np.array([[1,2,3]])    # (1,3) - 행렬. 2차원
print("x2 = ", x2.shape)    # x2 =  (1, 3)

x3 = np.array([[1,2], [3,4]])   # (2,2)
print("x3 = ", x3.shape)    # x3 =  (2, 2)

x4 = np.array([[1,2], [3,4], [5,6]])    # (3,2) - 저차원부터 세면 편함. 2,3
print("x4 = ", x4.shape)    # x4 =  (3, 2)

# x4 = np.array([[1,2], [3,4], [5,6,]])
# # python 기초 - 리스트 말고도 함수 등에서도 끝에 , 들어가도 문제없음

x5 = np.array([[[1,2], [3,4], [5,6]]])  # (1,3,2) - 텐서(tensor). 3차원. 4차원부터는 n차원 텐서로 표현
print("x5 = ", x5.shape)    # x5 =  (1, 3, 2)

x6 = np.array([[[1,2],[3,4]], [[5,6],[7,8]]]) # (2,2,2)
print("x6 = ", x6.shape)    # x6 =  (2, 2, 2)

x7 = np.array([[[[[1,2,3,4,5],[6,7,8,9,10]]]]]) # (1,1,1,2,5)
print("x7 = ", x7.shape)    # x7 =  (1, 1, 1, 2, 5)

x8 = np.array([[[1,2,3]], [[4,5,6]]]) # (2,1,3)
print("x8 = ", x8.shape)    # x8 =  (2, 1, 3)

x9 = np.array([[[[1]]], [[[2]]]]) # (2,1,1,1)
print("x9 = ", x9.shape)    # x9 =  (2, 1, 1, 1)

